<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<title>Tarea 4</title>
	<link rel="stylesheet" type="text/css" href="CSS/HojaDeEstilospro.css">
	<link rel="stylesheet" type="text/css" href="CSS/HojaDeEstilos4pro.css">
</head>
<body>
		<div class="madre">
			<h1>Python</h1><br><hr><br>
			<img src="imagenes/Tareapro4Img1.jpg" alt="imagen de Python" id="imglef">
			<img src="imagenes/Tareapro4Img4.jpg" alt="imagen de palabras clave" id="imgder"><h2>S&iacute;mbolos, sintaxis y Esqueleto de programa</h2>
			<p>Los operadores mas comunes que se utilizan en Python corresponden a lo siguiente:</p>
			<p>Suma +</p>
			<p>Resta -</p>
			<p>Multiplicaci&oacute;n *</p>
			<p>Exponente **</p>
			<p>Modulo % (residuo)</p>
			<p>Divisi&oacute;n /</p>
			<p>Divisi&oacute;n Entera //</p>
			<p>La sintaxis de Python se rige por una serie de Reglas Generales que sirven para dar orden, coherencia y limpieza al lenguaje.<br>
				<ul>
					<img src="imagenes/Tareapro4Img5.jpg" alt="Consola de python" id="imglef">
					<li><strong>Las l&iacute;neas f&iacute;sicas </strong>son secuencias de caracteres que concluyen con el car&aacute;cter de fin de l&iacute;nea (\n en sistemas Unix-Like o \r\n en Windows).</li><br>
					<li><strong>Las l&iacute;neas l&oacute;gicas </strong>por su parte son componentes l&oacute;gicos de la sintaxis de Python, cuyo final est&aacute; determinado por el token o se&ntilde;al de nueva l&iacute;nea (<em>NEWLINE</em>). Este token determina el fin de una l&iacute;nea l&oacute;gica y da comienzo de otra.</li>
				</ul>
			</p>
			<img src="imagenes/Tareapro4Img2.jpg" alt="imagen de palabras clave" id="imgder">

			<p>Si una l&iacute;nea l&oacute;gica se inicia con un par&eacute;ntesis (, se extender&aacute; por tantas l&iacute;neas f&iacute;sicas como sea necesario y solo terminar&aacute; con el car&aacute;cter de cierre, es decir,). Esto tambi&eacute;n se cumple para los corchetes [] y las llaves {}.<br>
				
				<ul>
					<li><strong>Las sentencias simples</strong>, que deben completarse en una &uacute;nica l&iacute;nea l&oacute;gica</li><br>
					<li><strong>Las sentencias compuestas</strong>, que deben comenzar con una cl&aacute;usula de sentencia compuesta y deben contener sentencias simples y/o compuestas indentadas, a las cuales se les suele llamar cuerpo o bloque. La cl&aacute;usula inicial o encabezado de una sentencia compuesta inicia siempre con una palabra clave (<em>keyword</em>) y termina con el car&aacute;cter de dos puntos “:”.</li><br>

					<li>Un <strong>comentario</strong> es una secuencia de caracteres que comienza con el car&aacute;cter de numeral # y contin&uacute;a hasta el fin de la l&iacute;nea f&iacute;sica.</li>
				</ul>
			</p>

			<h3>Tokens</h3>
			<p>Los tokens son componentes lexicogr&aacute;ficos elementales que forman cada una de las l&iacute;neas l&oacute;gicas. En la sintaxis de Python se reconocen los tokens o se&ntilde;ales siguiente:<br>
				<ul>
					<li><strong>NEWLINE: </strong>determina el fin de una l&iacute;nea l&oacute;gica y el comienzo de otra.</li><br>
					<li><strong>INDENT: </strong>indentaci&oacute;n de las sentencias dentro de una sentencia compuesta.</li><br>
					<li><strong>DEDENT: </strong>fin de indentaci&oacute;n que determina el fin de una sentencia compuesta.</li><br>
					<li><strong>Identificadores</strong><em>(identifiers): </em>nombres que identifican a variables, funciones, clases, m&eacute;todos, constantes, m&oacute;dulos, paquetes, etc. Los identificadores comienzan con letras (A – Z, a – z) o con guiones bajos (_), seguidos de cero o m&aacute;s letras, guiones bajos o d&iacute;gitos (0 – 9).</li><br>
					<li><strong>Palabras clave o reservadas </strong><em>(keywords): </em>palabras con significado especial para el lenguaje, que no pueden ser empleadas como identificadores. Algunas palabras clave son sentencias simples (Ej. break, continue), otros, cl&aacute;usulas de sentencias compuesta (Ej. def, class, for, while), mientras que otras son operadores (Ej. and, or, is, in).</li><br>
				</ul>
			</p>
			<p>La estructura correspondiente a python es:</p>
			<p>#! /usr/bin/env Python</p>
			<p># -*- coding: utf-8 -*-   (Necesario para los caracteres especiales)</p>
			<p>Nombre de librer&iacute;a</p>
			<p>Funciones que se van a importar</p>
			<p>L&iacute;neas de c&oacute;digo a utilizar</p>
			<h2>Aplicaci&oacute;n para descargar</h2>
			<p>Python puede descargarse mediante su pagina oficial descargando un interprete para que nuestra computadora pueda ser capaz de comprenderlo. Tambi&eacute;n es necesario usar visual studio code para poder editar el c&oacute;digo.</p>
			<p>Algunos interpretes pueden ser:</p>
			<ul>
				<li>PyPy</li>
				<li>Jython</li>
				<li>PythonNet</li>
			</ul>
			<center>
				<img src="imagenes/Tareapro4Img6.jpg" alt="Pypy" id="imgcen">
				<img src="imagenes/Tareapro4Img7.jpg" alt="Jython" id="imgcen">
				<img src="imagenes/Tareapro4Img8.jpg" alt="PythonNet" id="imgcen">
			</center>
			<img src="imagenes/Tareapro4Img9.jpg" alt="Programacion orientada a objetos" id="imglef">
			<img src="imagenes/Tareapro4Img10.jpg" alt="Programacion imperativa" id="imgder">
			<h2>Paradigma perteneciente</h2>
			<p>Python es un lenguaje de programaci&oacute;n multiparadigma. Esto significa que más que forzar a los programadores a adoptar un estilo particular de programaci&oacute;n, permite varios estilos: programaci&oacute;n orientada a objetos, programaci&oacute;n imperativa y programaci&oacute;n funcional. Otros paradigmas están soportados mediante el uso de extensiones.</p><br><br><br><br><br><br><br><br>
			<h2>Ejemplo de programaci&oacute;n</h2>
			<p>Escribir una función que tome un carácter y devuelva True si es una vocal, de lo contrario devuelve False.</p>
			<p>#! /usr/bin/env python</p>
			<p># -*- coding: utf-8 -*-</p>
			<p>def es_vocal (x):</p>
			<p>		if x == "a" or x == "e" or x == "i" or x == "o" or x == "u":</p>
			<p>			return True</p>
			<p>		elif x == "A" or x == "E" or x == "I" or x == "O" or x == "U":</p>
			<p>			return True</p>
			<p>		else:</p>
			<p>			return False</p>
			<p>caracter = input("introduce una letra por favor: ")</p>
			<p>print(es_vocal(caracter))</p>
			<center>
				<img src="imagenes/Tareapro4Img3.jpg" alt="imagen de palabras clave" id="imgcen">
			</center>
		</div>
		<div class="Vuelta">
		<center><a href="Tarea3pro.html" class="link">Anterior</a></center>
	</div>
	<div class="Principal">
		<center><a href="MenuTareas.html" class="link">Menu tareas</a></center>
	</div>
	
	<div class="Siguiente">
		<center><a href="Tarea5pro.html" class="link">Siguiente</a></center>	
	</div>
</body>
</html>