<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<title>Tarea 2</title>
	<link rel="stylesheet" type="text/css" href="CSS/HojaDeEstilos2pro.css">
	<link rel="stylesheet" type="text/css" href="CSS/HojaDeEstilospro.css">
	<meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximun-scale=1.0, minimun-scale=1.0">
</head>
<body>
	<div class="madre">
		<h1>Lenguajes de Programaci&oacute;n</h1><br><hr><br>
		<img src="imagenes/Tareapro2Img2.jpg" alt="imagen de solucion de problemas" id="imglef">
		<img src="imagenes/Tareapro2Img1.jpg" alt="imagen de diferentes lenguajes de programación" id="imgder">
		<h2>¿Que es un lenguaje de programación?</h2>
		

		<p>Un lenguaje de programaci&oacute;n es un lenguaje formal creado para poder seguir estructuras mediante algunos caracteres definidos por una instituci&oacute;n encargada de estas regulaciones en caso de los de modificaci&oacute;n abierta que pueden ser utilizados para realizar procesos y llegar a la soluci&oacute;n de un problema/necesidad de un usuario. Pueden usarse para crear programas que controlen el comportamiento f&iacute;sico y l&oacute;gico de una m&aacute;quina, para expresar algoritmos con precisi&oacute;n, o como modo de comunicaci&oacute;n humana.</p>
		<p>La implementaci&oacute;n de lenguajes de programaci&oacute;n permite el trabajo conjunto y coordinado, a trav&eacute;s de un conjunto af&iacute;n y finito de instrucciones posibles, de diversos programadores o arquitectos de software, para lo cual estos lenguajes imitan, al menos formalmente, la l&oacute;gica de los lenguajes humanos o naturales.
		</p>
		<p>No deben confundirse, sin embargo, con los distintos tipos de lenguaje inform&aacute;tico. Estos &uacute;ltimos representan una categor&iacute;a mucho m&aacute;s amplia, en donde est&aacute;n contenidos los lenguajes de programaci&oacute;n y muchos otros protocolos inform&aacute;ticos, como el HTML de las p&aacute;ginas web.
		</p><br>
		<h2>Tipos de lenguajes de programaci&oacute;n</h2>
		<p>Normalmente se distingue entre los siguientes tipos de lenguaje de programaci&oacute;n:
		</p>
		<p><strong>Lenguajes de bajo nivel.</strong> Se trata de lenguajes de programaci&oacute;n que est&aacute;n dise&ntilde;ados para un hardware espec&iacute;fico y que por lo tanto no pueden migrar o exportarse a otros computadores. Sacan el mayor provecho posible al sistema para el que fueron dise&ntilde;ados, pero no aplican para ning&uacute;n otro.
    	</p>
    	<p><strong>Lenguajes de alto nivel.</strong> Se trata de lenguajes de programaci&oacute;n que aspiran a ser un lenguaje m&aacute;s universal, por lo que pueden emplearse indistintamente de la arquitectura del hardware, es decir, en diversos tipos de sistemas. Los hay de prop&oacute;sito general y de prop&oacute;sito espec&iacute;fico.</p>
    	<p><strong>Lenguajes de nivel medio.</strong> Este t&eacute;rmino no siempre es aceptado, que propone lenguajes de programaci&oacute;n que se ubican en un punto medio entre los dos anteriores: pues permite operaciones de alto nivel y a la vez la gesti&oacute;n local de la arquitectura del sistema.</p>
		</p>
		<center>
			<img src="imagenes/Tareapro2Img3.jpg" alt="imagen de tipos de lenguajes" id="imgcen">
			<img src="imagenes/Tareapro2Img4.jpg" alt="imagen de lenguajes de alto nivel" id="imgcen">
			<img src="imagenes/Tareapro2Img5.jpg" alt="imagen de diagrama de los lenguajes de programacion" id="imgcen">
		</center>
		<br>
		<h2>Clasificaci&oacute;n de lenguajes de alto nivel</h2>
		<p>Una clasificaci&oacute;n muy extendida desde el punto de vista de trabajar de los programas y la filosof&iacute;a de su creaci&iacute;n es la siguiente:</p>
		<ul>
			<li>Lenguajes de programaci&oacute;n imperativos </li>
			<li>Lenguajes de programaci&oacute;n declarativos</li>
			<li>Lenguajes de programaci&oacute;n orientados a objetos</li>
			<li>Lenguajes de programaci&oacute;n orientados al problema</li>
			<li>Lenguajes de programaci&oacute;n naturales</li>
		</ul>
		<center>
			<img src="imagenes/Tareapro2Img6.jpg" alt="imagen de tipos de programacion" id="imgcen">
			<img src="imagenes/Tareapro2Img7.jpg" alt="imagen de programacion declarativa" id="imgcen">
		</center>
		<h3>Ejemplos de lenguajes</h3>
		<p>Interpretados:  Motor Zend, CPython, Ruby MRI, YARV.</p>
		<p>Compilados: C, Forth, Delphi, Haskell.</p>
		<p>Orientado a objetos:  COBOL, Perl, C#, Visual Basic.NET, PHP</p>
		<p>Funcionales:  Elixir, Kotling, Haskell, Erlang</p>
		<center>
			<img src="imagenes/Tareapro2Img8.jpg" alt="imagen de programacion Interpretada" id="imgcen">
			<img src="imagenes/Tareapro2Img9.jpg" alt="imagen de programacion compilada" id="imgcen">
			<img src="imagenes/Tareapro2Img10.jpg" alt="imagen de programacion orientada a objetos" id="imgcen">
		</center>
	</div>
	<div class="Vuelta">
		<center><a href="Tarea1pro.html" class="link">Anterior</a></center>
	</div>
	<div class="Principal">
		<center><a href="MenuTareas.html" class="link">Menu tareas</a></center>
	</div>
	
	<div class="Siguiente">
		<center><a href="Tarea3pro.html" class="link">Siguiente</a></center>	
	</div>

</body>
</html>