<!DOCTYPE html>
<html>
<head>
	<title>Tarea 7</title>
	<meta charset="utf-8">
	<link rel="stylesheet" type="text/css" href="CSS/HojaDeEstilospro.css">
	<link rel="stylesheet" type="text/css" href="CSS/HojaDeEstilos7pro.css">
</head>
<body>
	<div class="madre">
		<h1>Lenguaje R</h1><br><hr><br>
		<img src="imagenes/Tareapro7Img1.jpg" alt="imagen de lenguaje R" id="imgder">
		<h2>Simbolos, Sintaxis, Esqueleto</h2>
		<p>
			Numerosas empresas y universidades utilizan el software R para sus an&aacute;lisis y es uno de los lenguajes m&aacute;s utilizados en investigaci&oacute;n cient&iacute;fica. R es un ambiente de programaci&oacute;n formado por un conjunto de herramientas muy flexibles que pueden ampliarse f&aacute;cilmente mediante paquetes, librer&iacute;as o definiendo nuestras propias funciones.
		</p>
		<img src="imagenes/Tareapro7Img2.jpg" alt="imagen de lenguaje R sobre caracteristicas" id="imglef">
		<p>Las normas b&aacute;sicas que definen la sintaxis de R son:</p>
		<ul>
			<li>No se tienen en cuenta los espacios en blancos: podemos o no dejar espacios para que el c&oacute;digo se puede ordenar de forma adecuada y poder entenderse.</li>
			<li>Se distinguen las may&uacute;sculas y min&uacute;sculas: para variables en el c&oacute;digo, podemos crear diferentes variables con nombres iguales, pero alternando may&uacute;sculas y min&uacute;sculas.</li>
			<li>Se pueden incluir comentarios: como vimos anteriormente los comentarios se utilizan para a&ntilde;adir información en el c&oacute;digo.</li>
			<li>No es necesario terminar cada sentencia con el car&aacute;cter de punto y coma (;): en la mayoría de los lenguajes de programaci&oacute;n, es obligatorio terminar cada sentencia con este car&aacute;cter. En en cambio R podemos o no terminar de esta forma.</li>
			<li>Lenguaje orientado a objetos: todo en R son objetos, las variables, datos, funciones y resultados, que se generan en R son objetos estos se modifican o manipulan con operadores o funciones (que a su vez son objetos).</li>
		</ul>
		<h2>Aplicaci&oacute;n para descargar</h2>
		<p>El editor de este lenguaje puede ser descargado directamente desde la pagina oficial del lenguaje R.</p>
		<p>La creada por el R Development Core Team</p>
		<p>La desarrollada por Tibco (y, previamente, por Insightful) para S-Plus, el dialecto propietario de R (o S).</p>
		<center>
			<img src="imagenes/Tareapro7Img4.jpg" alt="imagen de R development Core Team" id="imgcen">
			<img src="imagenes/Tareapro7Img10.jpg" alt="imagen de lenguaje R en proceso" id="imgcen">
			<img src="imagenes/Tareapro7Img3.jpg" alt="imagen de S-Plus" id="imgcen">
		</center>
		<img src="imagenes/Tareapro7Img5.jpg" alt="imagen de lenguaje R del tipo orientado a objetos" id="imglef">
		<img src="imagenes/Tareapro7Img9.jpg" alt="imagen de lenguaje R del tipo orientado a objetos en usuarios" id="imgder">
		<h2>Paradigma perteneciente</h2>
		<p>El lenguaje de programaci&oacute;n conocido con R corresponde a la categor&iacute;a de ser un lenguaje orientado a objetos, debido a esto representa algo de simplicidad y flexibilidad ante los problemas propuestos, pero tambien cuenta con la desventaja de que al crear demasiados modulos de programación, la dificultad aumenta exponencialmente respecto a lo realizado. </p>
		<p>En la programaci&oacute;n orientada a objetos Los objetos manipulan los datos de entrada para la obtenci&oacute;n de datos de salida espec&iacute;ficos, donde cada objeto ofrece una funcionalidad especial.
		</p>
		<p>Muchos de los objetos prediseñados de los lenguajes de programaci&oacute;n actuales permiten la agrupaci&oacute;n en bibliotecas o librer&iacute;as, sin embargo, muchos de estos lenguajes permiten al usuario la creación de sus propias bibliotecas. 
		</p>
		<h2>Ejemplo</h2>
		<p>En el estudio de Missouri, el peso promedio al nacer de los bebés de fumadoras es 3180 gramos y la SD es de 500 gramos. ¿Cuál es la media y la SD en onzas? Hay 0,035 onzas en 1 gramo.Se debe usar una regla de tres, la cual se plantearía de la siguiente manera para la media: Con esta misma lógica la desviación estándar SD en onzas vendría dada por: Programando esto en R nos quedaría que:
		</p>
		<p>MediO=(3180*0.035)/1 ##Media en Onzas</p>
		<p>MediO ##Esta es la media en onzas.</p>
		<p>[1] 111.3</p>
		<p>## Ahora bien la desviación estándar en onzas vendrá dada por</p>
		<p>SDO=(500*0.035)/1 ## SD en Onzas> SDO[1] 17.5</p>
		<center>
			<img src="imagenes/Tareapro7Img6.jpg" alt="imagen de Gentelman" id="imgcen">
			<img src="imagenes/Tareapro7Img8.jpg" alt="imagen de ejemplos del uso del lenguaje R" id="imgcen">
			<img src="imagenes/Tareapro7Img7.jpg" alt="imagen de Ihaka" id="imgcen">
		</center>
	</div>
	<div class="Vuelta">
		<center><a href="Tarea6pro.html" class="link">Anterior</a></center>
	</div>
	<div class="Principal">
		<center><a href="MenuTareas.html" class="link">Menu tareas</a></center>
	</div>
	
	<div class="Siguiente">
		<center><a href="Tarea8pro.html" class="link">Siguiente</a></center>	
	</div>

</body>
</html>